place_database = {
    "정문": {
        "lat": 37.56039,
        "lon": 126.936751,
        "desc": "연세대학교의 정문은 캠퍼스를 상징하는 대표적인 입구입니다. 백양로의 시작점이며 캠퍼스의 주요 건물로 연결되는 출발점입니다."
    },
    "공학원": {
        "lat": 37.560824,
        "lon": 126.935447,
        "desc": "공학대학의 중심 건물로, 여러 공학 계열 연구실이 위치해 있습니다. 지하에  메가커피, 문구점 등이 있습니다."
    },
    "제1공학관": {
        "lat": 37.561767,
        "lon": 126.936632,
        "desc": "정문에 들어가자마자 백양로 왼쪽으로 보이는 공학관입니다. 전기전자, 기계 등 다양한 공학 실습이 이뤄지는 핵심 공간입니다. 편의점과 마호가니 카페가 있습니다."
    },
    "제2공학관": {
        "lat": 37.562396,
        "lon": 126.93486,
        "desc": "실험실, 연구실이 배치되어 있는 첨단 공학 교육 공간입니다. 제 1공학관을 지나가면 다음 건물에 있습니다."
    },
    "제3공학관": {
        "lat": 37.561697,
        "lon": 126.935066,
        "desc": "공과대학 교수 연구실과 일부 전공 강의실이 혼합된 건물입니다. 제2공학관과 연결되어 있습니다."
    },
    "제4공학관": {
        "lat": 37.561859,
        "lon": 126.93621,
        "desc": "최신 실험장비가 구비된 공학 실험 중심 공간입니다. 비교적 신축 건물로 최신 실험·연구 장비가 마련된 첨단 연구 공간입니다. 제1 공학관과 연결되어 있습니다."
    },
    "대운동장": {
        "lat": 37.562229,
        "lon": 126.933458,
        "desc": "연세대학교 내 최대 야외 운동 시설로, 축제나 체육 행사에 자주 활용됩니다. 축구 코트와 트랙이 있습니다."
    },
    "야구장": {
        "lat": 37.561481,
        "lon": 126.934126,
        "desc": "야구부 및 동아리 활동이 활발히 이루어지는 체육 공간입니다."
    },
    "과학원": {
        "lat": 37.563393,
        "lon": 126.934637,
        "desc": "연세대학교의 기초과학 교육 중심 건물로, 물리, 화학, 생물 실험과 강의가 이루어집니다. 다양한 실험실과 강의실이 위치하며, 이공계 학생들의 주요 학습 공간입니다."
    },
    "GS칼텍스산학협력관": {
        "lat": 37.562811,
        "lon": 126.933135,
        "desc": "산학협력 프로그램과 연구 프로젝트가 진행되는 공간입니다."
    },
    "백양누리": {
        "lat": 37.563183,
        "lon": 126.937388,
        "desc": "학생 복지 및 활동 공간으로 다양한  카페, 샐러디, 마호가니 카페, 스타벅스 카페, 연세 굿즈샵 등이 있습니다. 그 외에 세미나 룸, 대형 홀과 라운지가 있습니다. 실외에는 독수리 상과 분수가 있어서 사진을 찍기 좋습니다."
    },
    "백주년기념관": {
        "lat": 37.561869,
        "lon": 126.937779,
        "desc": "연세대학교 100주년을 기념하여, 지어진 건물로 각종 공식 행사가 열립니다."
    },
    "학생회관": {
        "lat": 37.563474,
        "lon": 126.938308,
        "desc": "학생 복지를 위한 주요 공간으로, 식당(맛나샘, 고를샘, 부를샘) 과 편의시설이 있습니다. 다양한 한식, 분식, 비건 메뉴 등을 제공합니다. 미용실, 편의점, 안경원 등이 있고, 위층으로는 학생회와 동아리방이 위치하고 있습니다."
    },
    "중앙도서관": {
        "lat": 37.563675,
        "lon": 126.936878,
        "desc": "연세대학교의 주요 도서관으로 다양한 자료를 보유하고 있습니다. 학생회관 맞은편에 있습니다. 편의점과 다양한 자료, 대형 열람실이 있습니다."
    },
    "연세삼성학술정보관": {
        "lat": 37.563903,
        "lon": 126.936099,
        "desc": "중앙도서관과 연결된 최첨단 학술 정보 공간으로 ‘신중도’라고 불립니다. 다양한 자료와 열람실, 회의실 등이 구비되어 있습니다."
    },
    "과학관": {
        "lat": 37.564202,
        "lon": 126.934559,
        "desc": "자연계열 기초과학 수업이 이루어지는 강의동입니다."
    },
    "삼성관": {
        "lat": 37.564959,
        "lon": 126.934284,
        "desc": "삼성그룹의 지원으로 지어진 생활과학계열 강의동입니다."
    },
    "광복관": {
        "lat": 37.564631,
        "lon": 126.936848,
        "desc": "강의실 중심 건물이며, 사회과학 계열 전공 수업이 많이 열리는 곳입니다. 이름은 한국 광복을 기념하는 의미로 붙은 상징적인 건물이기도 합니다."
    },
    "백양관": {
        "lat": 37.564655,
        "lon": 126.937667,
        "desc": "연세대학교의 상징적인 건물로, 인문사회계열 수업이 주로 이루어집니다."
    },
    "대강당": {
        "lat": 37.564339,
        "lon": 126.938789,
        "desc": "입학식, 졸업식 등 주요 행사가 열리는 중앙 강당입니다."
    },
    "루스채플": {
        "lat": 37.563323,
        "lon": 126.938966,
        "desc": "예배 및 종교 활동이 이루어지는 연세대의 대표 채플 건물입니다."
    },
    "노천극장": {
        "lat": 37.565444,
        "lon": 126.939624,
        "desc": "야외 공연과 아카라카 행사 등 대형 이벤트가 열리는 공연장입니다."
    },
    "음악관": {
        "lat": 37.563958,
        "lon": 126.940442,
        "desc": "음악대학 강의 및 실습 공간으로, 연습실과 공연장이 갖춰져 있습니다."
    },
    "언더우드관": {
        "lat": 37.566387,
        "lon": 126.938718,
        "desc": "언더우드 선교사를 기념한 건물로, 고전 건축 양식이 특징입니다. 언더우드관 앞에는 정원과 언더우드 동상이 있습니다."
    },
    "신학관": {
        "lat": 37.565894,
        "lon": 126.9367,
        "desc": "신학과 관련된 강의가 이루어지는 고전적인 분위기의 건물입니다."
    },
    "한경관": {
        "lat": 37.565994,
        "lon": 126.937371,
        "desc": "점심/저녁에 뷔페 식 학식을 제공합니다. 제육, 라면 등의 메뉴를 제공합니다."
    },
    "외솔관": {
        "lat": 37.566398,
        "lon": 126.936877,
        "desc": "국문학과 관련된 강의 및 연구가 이루어지는 공간입니다."
    },
    "교육과학관": {
        "lat": 37.566687,
        "lon": 126.937585,
        "desc": "교육학 및 과학교육 관련 전공 수업이 열리는 공간입니다."
    },
    "연희관": {
        "lat": 37.567285,
        "lon": 126.939092,
        "desc": "다양한 전공 강의가 진행되는 중형 강의동입니다."
    },
    "대우관": {
        "lat": 37.568369,
        "lon": 126.93941,
        "desc": "대형 강의실과 세미나실이 배치된 건물입니다."
    },
    "청송대": {
        "lat": 37.566722,
        "lon": 126.940963,
        "desc": "연세대 정문에서 백양로를 따라 캠퍼스를 오르다 노천극장을 끼고 돌면 마주하는 숲인 청송대는 이름대로 사시사철 푸른 소나무 숲이 우거진 연세인들의 뒷뜰입니다다. 잠시 쉼이 필요할 때, 산책을 하거나 피크닉을 즐길 수 있습니다."
    },
}
